## CREATION OF DATAFRAME

* A pandas DataFrame can be created using :

    * Lists
    * dict
    * list of dicts
    * Another DataFrame

### Empty DataFrame

In [1]:
import pandas as pd
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [2]:
print(df)

Empty DataFrame
Columns: []
Index: []

### Using Lists

In [3]:
#ex-1
data=[5,4,3,2,1,0]
df=pd.DataFrame(data)
df

   0
0  5
1  4
2  3
3  2
4  1
5  0

In [4]:
#ex-2
data=[['Hyderabad',30],['Banglore',25],['chennai',40]]
df=pd.DataFrame(data,columns=['Place','Temp'])
df

       Place  Temp
0  Hyderabad    30
1   Banglore    25
2    chennai    40

### Using Dict

In [5]:
data={'place':['Hyderabad','Banglore','Chennai'],'Temp':[30,25,40]}
df=pd.DataFrame(data)
df

       place  Temp
0  Hyderabad    30
1   Banglore    25
2    Chennai    40

In [6]:
## indexed dataframe using arrays

In [7]:
data={'place':['Hyderabad','Banglore','Chennai'],'Temp':[30,25,40]}
df=pd.DataFrame(data,index=[1,2,3])
df

       place  Temp
1  Hyderabad    30
2   Banglore    25
3    Chennai    40

### Using List of Dicts

In [8]:
data = [{'Hyderabad':33, 'Banglore': 23},{'Hyderabad': 30, 'Banglore': 27}]
df = pd.DataFrame(data,index=['Day1','Day2'])
df

      Banglore  Hyderabad
Day1        23         33
Day2        27         30

### Using Another DataFrame

#### append

This `append` function will add new rows to a DataFrame

In [9]:
import pandas as pd

df1= pd.DataFrame([[33,23]], columns = ['Hyderabad','Banglore'],index=['Day1'])
df2 = pd.DataFrame([[30,27]], columns = ['Hyderabad','Banglore'],index=['Day2'])

df = df1.append(df2)
df

      Hyderabad  Banglore
Day1         33        23
Day2         30        27

#### drop

This `drop` function will delete the specified rows in a DataFrame

In [10]:
import pandas as pd

df1= pd.DataFrame([[33,23]], columns = ['Hyderabad','Banglore'],index=['Day1'])
df2 = pd.DataFrame([[30,27]], columns = ['Hyderabad','Banglore'],index=['Day2'])

df = df1.append(df2)
df=df.drop('Day2') #drop the day2 axes
df

      Hyderabad  Banglore
Day1         33        23